app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    @blogs = Blog.page(params[:page]).per(5)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @blog = Blog.includes(:comments).friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My great blog"], ["body", "started to build a website"], ["created_at", 2017-01-04 18:31:24 UTC], ["updated_at", 2017-01-04 18:31:24 UTC]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)