app/controllers/portfolios_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "portfolios" SET "position" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["position", 1], ["updated_at", 2017-01-26 22:51:35 UTC], ["id", 6]]
---
  def sort
    params[:order].each do |key, value|
      Portfolio.find(value[:id]).update(position: value[:position])