app/controllers/portfolios_controller.rb

  def index
    @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios" ORDER BY position ASC

  def create
    @portfolio_item = Portfolio.new(portfolio_params)


      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "yeah"], ["subtitle", "what"], ["body", "lal;djf"], ["created_at", 2017-01-10 00:06:15 UTC], ["updated_at", 2017-01-10 00:06:15 UTC]]

    def show
      @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      @portfolio_item = Portfolio.find(params[:id])

      if @portfolio_item.update(portfolio_params)
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "main_image" = $1, "thumb_image" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["main_image", "rails_model_direction.png"], ["thumb_image", "rails_model_direction.png"], ["updated_at", 2017-01-30 21:59:25 UTC], ["id", 16]]

    def destroy
      @portfolio_item = Portfolio.find(params[:id])
      @portfolio_item.destroy
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 10]]